RT-Thread/rt-thread/bsp/nrf52832/nRF5_SDK_13.0.0_04a0bfd/components/libraries/log/src/nrf_log_frontend.c
    uint32_t wr_idx;
    if (buf_prealloc(CEIL_DIV(length, 4) + 1, &wr_idx))
    {
        HEXDUMP_HEADER_DEF(header, severity, length);
        m_log_data.buffer[wr_idx++ & mask] = header.raw;
#if NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = m_log_data.timestamp_func();
#endif //NRF_LOG_USES_TIMESTAMP
        m_log_data.buffer[wr_idx++ & mask] = (uint32_t)p_str;
        uint32_t space0 = sizeof(uint32_t) * (m_log_data.mask + 1 - (wr_idx & mask));
        if (length <= space0)
        {
            memcpy(&m_log_data.buffer[wr_idx & mask], p_data, length);
        }
        else
        {
            memcpy(&m_log_data.buffer[wr_idx & mask], p_data, space0);
            length -= space0;
            memcpy(&m_log_data.buffer[0], &((uint8_t *)p_data)[space0], length);
        }
    }
#endif //(NRF_LOG_DEFERRED == 0)
}


bool buffer_is_empty(void)
{
    return (m_log_data.rd_idx == m_log_data.wr_idx);
}


bool nrf_log_frontend_dequeue(void)
{
    if (buffer_is_empty())
    {
        return false;
    }

    uint32_t rd_idx        = m_log_data.rd_idx;
    uint32_t mask          = m_log_data.mask;
    uint32_t header_rd_idx = rd_idx;
    // uint32_t header = m_log_data.buffer[rd_idx++ & mask];
    nrf_log_header_t header;
    header.raw = m_log_data.buffer[rd_idx++ & mask];

    // Skip any string that is pushed to the circular buffer.
    while (header.generic.type == HEADER_TYPE_PUSHED)
    {
        rd_idx       += (header.pushed.len + header.pushed.offset);
        header_rd_idx = rd_idx;
        header.raw    = m_log_data.buffer[rd_idx++ & mask];
    }

    uint32_t * p_timestamp = NRF_LOG_USES_TIMESTAMP ?
                             &m_log_data.buffer[rd_idx++ & mask] : NULL;

    if (header.generic.raw)
    {
        p_timestamp = NULL;
    }

    bool ret = false;
    if (header.generic.type == HEADER_TYPE_HEXDUMP)
    {
        // buffer
        char   * p_str  = (char *)m_log_data.buffer[rd_idx++ & mask];
        uint32_t length = header.hexdump.len;
        uint32_t offset = header.hexdump.offset;
        uint32_t space0 = sizeof(uint32_t) * (mask + 1 - (rd_idx & mask));
        if (length > space0)
        {
            uint8_t * ptr0 = space0 ?
                             (uint8_t *)&m_log_data.buffer[rd_idx & mask] :
                             (uint8_t *)&m_log_data.buffer[0];
            uint8_t   len0 = space0 ? space0 : length;
            uint8_t * ptr1 = space0 ?
                             (uint8_t *)&m_log_data.buffer[0] : NULL;
            uint8_t len1 = space0 ? length - space0 : 0;

            offset = m_log_data.hexdump_handler(header.hexdump.severity,
                                                p_timestamp, p_str,
                                                offset,
                                                ptr0, len0,
                                                ptr1, len1);
        }
        else
        {
            offset = m_log_data.hexdump_handler(
                header.hexdump.severity,
                p_timestamp,
                p_str,
                offset,
                (uint8_t *)&m_log_data.buffer[rd_idx & mask],
                length,
                NULL, 0);
        }

        if (offset == length)
        {
            rd_idx += CEIL_DIV(length, 4);
            ret     = true;
        }
        else
        {
            // If there is more log to process just updated the offset but
            // do not move rd_idx.
            header.hexdump.offset                   = offset;
            m_log_data.buffer[header_rd_idx & mask] = header.raw;
        }
    }
    else // standard entry
    {
        uint32_t   args[6];
        uint32_t * p_arg = args;
        char     * p_str = (char *)((uint32_t)header.std.addr);
        uint32_t   nargs = header.std.nargs;

        uint32_t i;

        for (i = 0; i < nargs; i++)
        {
            *p_arg = m_log_data.buffer[rd_idx++ & mask];
            p_arg++;
        }

        ret = m_log_data.std_handler(header.std.severity,
                                     p_timestamp,
                                     p_str, args, nargs);
    }
    if (ret)
    {
        m_log_data.rd_idx = rd_idx;
    }
    return buffer_is_empty() ? false : true;

}

uint8_t nrf_log_getchar(void)
{
    return nrf_log_backend_getchar();
}

#endif // NRF_MODULE_ENABLED(NRF_LOG)
